Merge branch 'master' of https://github.com/cherkavi/cheat-sheet
