--- a/kafka-cheat-sheet.md
+++ b/kafka-cheat-sheet.md
@@ -1,33 +1,16 @@
-* [cli tool](https://github.com/electric-saw/kafta)
-
-## ksql
-```plantuml
-@startuml
-
-[ksql] as ksql 
-rectangle "kafka stream jar" as stream #lightgreen
-[app]  as app 
-
-[consumer \n producer] as consumer
-[kafka] as kafka
-
-ksql -right--> stream : use
-app o-- stream  : aggregate
-
-stream -right--> consumer
-consumer -up-> kafka
-
-@enduml
-```
 
 ## main concepts
 * Topics
@@ -74,19 +57,70 @@ leader, which topic exists
 ```
+
+## ksql
+```mermaid
+flowchart LR
+
+ksql --> ks["kafka \n stream"]
+ks --> cp[consumer\nproducer]
+```
+
+```plantuml
+@startuml
